const mainPage = {
  name: "main-page",
  briefAboutUsSection: {
    paragraph:
      "يهدف معهد الدلتا العالي إلى إتاحة الفرصة للطلاب للحصول على نوعية ممتازة وجادة ومتطورة من دراسات علوم الحاسبات وتكنولوجيا إدارة المعلومات على أيدي نخبة متميزة من أعضاء هيئة التدريس من الجامعات المصرية وعلى أحدث الأجهزة التعليمية المتطورة.",
    instituteGoals: [
      "المساهمة في إعداد وتنمية الكوادر الفنية المتخصصة في فروع الدراسة بالمعهد.",
      "تنمية القدرات والمهارات للقيادات المتخصصة فى الممارسة العلمية والعملية.",
      "تنمية البحث العلمي والعمل على إتاحة الفرص وحل المشكلات.",
    ],
  },
  studentsNumbersSection: {
    currentStudents: 5769,
    graduatedStudents: 10609,
  },
  commonQuestionsSection: [
    {
      questionName: "ما الدرجة العلمية التي يمنحها المعهد؟",
      questionAnswer: [
        "يمنح المعهد بكالوريوس في نظم المعلومات الإدارية (شعبة نظم).",
        "يمنح بكالوريوس في المحاسبة والمراجعة (شعبة المحاسبة).",
        "معتمد من المجلس الأعلى للجامعات ووزارة التعليم العالي ومنها تقدر تسجل في نقابة التجاريين.",
      ],
    },
    {
      questionName: "شروط القبول بالمعهد؟",
      questionAnswer: [
        "قبول الطالب الحاصلين على الثانوية العامة بشعبتيها الأدبية والعلمية.",
        "قبول الطالب الحاصلين على الشهادات المعادلة لثانوية العامة عربي وأجنبي.",
        "قبول الطالب الحاصلين على الثانوية التجارية نظام 3و5 سنوات.",
        "قبول الطالب الحاصلين على الثانوية الفنية للإدارة والخدمات.",
      ],
    },
    {
      questionName: "ما هو الحد الأدنى للقبول في المعهد؟",
      questionAnswer: [
        "الشعبة العلمية: 52.68%",
        "الشعبة الأدبية: 54.26%",
        "ثانوي صناعي 3 سنوات: 83.85%",
        "ثانوي صناعي 5 سنوات: 60%",
        "ثانوي تجاري 3 سنوات: 72.93%",
        "ثانوي تجاري 5 سنوات: 72.20%",
      ],
    },
    {
      questionName: "ما هي الأوراق المطلوبة للتقديم في المعهد؟",
      questionAnswer: [
        "أصل المؤهل.",
        "بطاقة الترشيح.",
        "أصل شهادة الميلاد.",
        "صورة البطاقة الشخصية.",
        "بطاقة 2 جند (للذكور فقط).",
        "بطاقة 6 جند (للذكور فقط).",
        "عدد 6 صور شخصيه (4 * 6).",
      ],
    },
  ],
};

const chairmanOfBoardOfDirectors = {
  pageName: "chairman-of-board-of-directors",
  speechBy: "كلمة السيد الدكتور محمد ربيع ناصر",
  speechParagraph:
    "التميز و الريادة فى مجال تكنولوجيا المعلومات هى كلمات و ضعناها نصب اعيننا و نحن نناقش رؤية و رسالة معهد الدلتا العالى لنظم المعلومات الادارية والمحاسبية لنقدم نموذجا متميزاً و رائد للتعليم بمنظوره الحديث و لقد كانت قناعتنا بان خريج معهدنا و مؤسساتنا التعليمية يجب ان تتاح له كافة الفرص للتزود بالمعارف الحديثة و صقل مهاراته فى مجالات الحاسب و تكنولوجيا المعلومات مما يجعل من اهتمامنا بتقديم كل الدعم لانجاح مشاريع التخرج ايمانا بابنائنا بانها بوتقة يتم فيها ثقل و تكامل المهارات فى عدد من علوم الحاسب الالى و نظم الاعمال من خلال تطبيقات عملية فى عدد من المشاركات و المؤسسات الحكومية و المدنية لاعداد الخريج لسوق العمل و لقد هيات ادارة المعهد كل البرمجيات و المعامل و الاساليب التى تفتح افاقا جديدة تحقق طموحات ابناؤها الخريجين و ادعو طلابنا ان يستثمروا هذة الامكانيات المتاحة ليتم اعدادهم لسوق العمل اعدادا متميزا و اننى ادعو لكم بكل توفيق و انقل اليكم تمنياتى و تمنيات اسرة الدلتا من معاهد و كليات و اعضاء مجلس الادارة و هيئة التدريس و العاملين و طلاب ان يكلل الله جهودكم بكل نجاح و ان يحقق الله على ايديكم لوطننا ما ننشده من رخاء و ازدهار ينطلقان به الى افاق جديدة من النهضة و التقدم تحت قيادة السيد الرئيس عبد الفتاح السيسى وكل عام وأنتم بخير.",
};

const instituteDean = {
  pageName: "institute-dean",
  speechBy: "كلمة السيد الدكتور أحمد أبو الفتوح",
  speechParagraph:
    "أبنائى وبناتى أمل المستقبل المشرق طلاب معهد الدلتا العالى لنظم المعلومات الإدارية والمحاسبية ، السلام عليكم ورحمة الله وبركاته مع بداية وإطلالة عام دراسى جديد يشرق على معهدنا ذو الكيان والتاريخ العريق يطيب لى أن أرحب بكم على موقع مؤسستكم التعليمية وأود أن أوجه خالص التحيه لإدارة المعهد ممثلة فى السيد الدكتور / محمد ربيع ناصر رئيس مجلس إدارة المعهد ورئيس الأكاديمية ورئيس مجلس أمناء جامعة الدلتا للعلوم والتكنولوجيا والسيد الأستاذ / إيهاب ناصر خليفه أمين المعهد ولكل من ينتسبون الى المعهد من أعضاء هيئة التدريس والعاملين ولأبنائى وبناتنى سواء من الخريجين أو من طلاب المعهد ، فتحية لكم من أعماقى ونحن نسعى سويا الى بناء حاضر ومستقبل واعد ومشرق من اجل مصرنا الحبيبة وسعيا نحو تحقيق ذلك يسعى المعهد دائما الى مواكبة كل ما هو جديد باستخدام التقنيات الحديثة فى مجال الحاسب ونظم المعلومات بالدمج مع بعض العلوم الأساسية كالمحاسبة والاقتصاد وإدارة الأعمال لسد إحتياجات سوق العمل من خريجى هذا المعهد . ومن أجل ذلك يحرص المعهد دائما بالدخول فى العديد من المشاركات وبروتوكولات التعاون مع الجامعات المصرية وبعض الشركات المتخصصة من أجل النهوض والإرتقاء بمستوى الخريج ، كما يتواصل المعهد مع مؤسسات المجتمع المدنى لدراسة إحتياجات سوق العمل للوفاء بها ، هذا بالاضافة الى إتاحة الفرصة لطلاب المعهد للمشاركة فى العديد من الأنشطة الثقافية والرياضية والفنية التى تنظمها وزارة التعليم العالى ومنح الطلاب حوافز فى شكل منح لتحفيزهم على تحقيق المزيد من التفوق . كما يحرص المعهد على عقد بعض ملتقيات التوظيف لإتاحة فرص عمل بالعديد من الشركات لأبنائنا الخريجين . وأخيرا أتمنى لجميع طلاب المعهد التوفيق والسداد وأن يوفقنا الله جميعا الى ما يحبه ويرضاه وكل عام وأنتم بخير.",
};

const instituteeStablishment = {
  pageName: "establishment-of-the-Institute",
  sections: [
    {
      sectionName: "نشأة المعهد",
      sectionContent: [
        "تأسس معهد الدلتا العالي لنظم المعلومات الإدارية والمحاسبية بالمنصورة عام 2000 بموجب القرار الوزاري رقم 1200 الصادر بتاريخ 11 يونيو 2000 وكان الهدف من إنشاء المعهد هو تلبية احتياجات سوق العمل المتزايدة من الكوادر المتخصصة في مجال نظم المعلومات الإدارية والمحاسبية.",
      ],
    },
    {
      sectionName: "بدأ المعهد الدراسة في العام الدراسي 2000/2001 بقسمين هما",
      sectionContent: [
        "برنامج البكالوريوس في نظم المعلومات الإدارية.",
        "برنامج البكالوريوس في المحاسبة.",
      ],
    },
    {
      sectionName: "",
      sectionContent: [
        "يُعدّ معهد الدلتا العالي لنظم المعلومات الإدارية والمحاسبية بالمنصورة من أهم المعاهد المتخصصة في هذا المجال في مصر ويقدم ايضا المعهد برامج تعليمية عالية الجودة تُلبي احتياجات سوق العمل، ويُشرف على التدريس فيه أعضاء هيئة تدريس ذوي خبرة واسعة في مجال نظم المعلومات الإدارية والمحاسبية.",
        "يتخرج من المعهد سنويًا دفعة جديدة من الخريجين الذين يُصبحون على الفور مطلوبين في سوق العمل ويُساهم أيضا المعهد بشكل كبير في تنمية الاقتصاد الوطني ودعم مسيرة التحول الرقمي في مصر.",
      ],
    },
  ],
};

const visionMissionGoals = {
  pageName: "vision-mission-goals",
  sections: [
    {
      sectionName: "روية المعهد",
      sectionContent: [
        "أن يكون معهدا رائدا محليا واقليميا له برامج تعليمية متميزة من خلال الشراكات البحثية والخدمة المجتمعية ونسعى ليكون معهدنا منارة للتميز في مجال علوم المحاسبة ونظم المعلومات الإدارية، ونُقدم برامج تعليمية متقدمة تُواكب أحدث التطورات العالمية، ونُعدّ طلابنا ليصبحوا خبراء في هذا المجال، ونُساهم في تنمية الاقتصاد الوطني ودعم مسيرة التحول الرقمي في مصر.",
      ],
    },
    {
      sectionName: "رسالة المعهد",
      sectionContent: [
        "يلتزم معهد الدلتا العالي لنظم المعلومات الادارية والمحاسبية بأعداد خريج متميز يواكب ديناميكية سوق العمل من خلال توفر بيئة تعليمية جاذبه، وانتاج أبحاث علمية تساهم في حل مشاكل المجتمع وتنمية البيئة محليه مع الالتزام بأخلاقيات المهنة.",
        "وأيضا نؤمن في معهدنا بأهمية نظم المعلومات الإدارية والمحاسبية في تحقيق النجاح والتميز للمنظمات في مختلف المجالات.",
      ],
    },
    {
      sectionName:
        "نسعى من خلال برامجنا التعليمية المتقدمة إلى إعداد طلاب متميزين قادرين على",
      sectionContent: [
        "فهم وتحليل احتياجات المنظمات من المعلومات.",
        "تصميم وتطوير وتنفيذ نظم المعلومات الإدارية والمحاسبية بكفاءة وفعالية.",
        "استخدام تقنيات المعلومات الحديثة لتحسين الأداء الإداري والمالي للمنظمات.",
        "اتخاذ القرارات الإدارية السليمة بناءً على المعلومات الدقيقة.",
        "المساهمة في تحقيق التنمية المستدامة للمنظمات والمجتمع.",
      ],
    },
    {
      sectionName: "",
      sectionContent: [
        "ونلتزم بتقديم برامج تعليمية عالية الجودة تُلبي احتياجات سوق العمل، وتُواكب أحدث التطورات العالمية في مجال نظم المعلومات الإدارية والمحاسبية وندعم طلابنا من خلال بيئة تعليمية تفاعلية تُشجع على الابتكار والإبداع، ونُقدم لهم فرصًا للتدريب العملي واكتساب الخبرات العملية وأيضا نُؤمن بأهمية الشراكة مع المؤسسات الرائدة في مجال نظم المعلومات الإدارية والمحاسبية، ونُسعى إلى تبادل الخبرات والمعرفة مع هذه المؤسسات لتطوير برامجنا التعليمية وتحسينها ونسعى أيضا من خلال رسالتنا إلى أن نكون مركزًا للتميز في مجال نظم المعلومات الإدارية والمحاسبية، وأن نُساهم في بناء مستقبل أفضل للمنظمات والمجتمع.",
      ],
    },
  ],
};

const academicAndAdministrativeLeaders = {
  pageName: "academic-and-administrative-leaders",
  instituteleaders: [
    {
      leaderName: "أ.د / أحمد أبو الفتوح صالح",
      leaderPosition: "عميد المعهد",
      imageSrc: "",
    },
    {
      leaderName: "أ.م.د / محمد الشربيني إسلام",
      leaderPosition: "رئيس قسم المحاسبة",
      imageSrc: "",
    },
    {
      leaderName: "أ.م.د / عبدالوهاب الراعي",
      leaderPosition: "أ.م.د / عبدالوهاب الراعي",
      imageSrc: "",
    },
    {
      leaderName: "أ.م.د / منصور شطا",
      leaderPosition: "وكيل البحث العلمي",
      imageSrc: "",
    },
    {
      leaderName: "د / أحمد البراشي",
      leaderPosition: "مدير وحدة ضمان الجودة",
      imageSrc: "",
    },
    {
      leaderName: "أ / إيهاب ناصر",
      leaderPosition: "الأمين العام",
      imageSrc: "",
    },
    {
      leaderName: "أ.د / حازم عطوه",
      leaderPosition: "وكيل شئون التعليم والطلاب",
      imageSrc: "",
    },
  ],
};

const organizationalChart = {
  pageName: "organizational-chart",
  orgChartImageSrc: "",
};

const instituteRegulations = {
  pageName: "institute-regulations",
  regulationsPdfFiles: [
    { pdfName: "اللائحة الجديدة", pdfSrc: "" },
    { pdfName: "اللائحة القديمة", pdfSrc: "" },
  ],
};

const classSchedules = {
  pageName: "class-schedules",
  studentClassSchedules: [
    { scheduleName: "جدول الفرقة الأولى", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الثانية", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الثالثة", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الرابعة", pdfSrc: "" },
  ],
};

const studentCourses = {
  pageName: "courses",
  studentCourses: [
    { coursesPlanName: "اللائحة الجديدة", coursesPlanPdfSrc: "" },
    { coursesPlanName: "اللائحة القديمة", coursesPlanPdfSrc: "" },
  ],
};

const examSchedules = {
  pageName: "exam-schedules",
  studentExamSchedules: [
    { scheduleName: "جدول الفرقة الأولى", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الثانية", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الثالثة", pdfSrc: "" },
    { scheduleName: "جدول الفرقة الرابعة", pdfSrc: "" },
  ],
};

const businessInformationSystems = {
  pageName: "business-information-systems",
  departmentHeadImageSrc: "",
  departmentHeadName: "أ.د / أحمد أبو الفتوح صالح",
  sections: [
    {
      sectionHeader: "مهام رئيس قسم نظم معلومات الأعمال",
      sectionListItems: [
        "مناقشة العميد التقسيمات الخاصة بالجداول والامتحانات وما يترتب عليها من تجهيزات.",
        "الاشراف على تنفيذ القرارات التنفيذية والتأكد من سلامة اجراءات التنفيذ.",
        "اعداد خطة سنوية باحتياجات القسم من السادة أعضاء هيئة التدريس والهيئة المعاونة.",
        "تلقى مقترحات القسم فى شأن جودة التعليم ودراستها .",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين اعضاء هيئة التدريس وندبهم.",
      ],
    },
  ],
};

const departmentOfAccounting = {
  pageName: "department-of-accounting",
  departmentHeadImageSrc: "",
  departmentHeadName: "أ.م.د / محمد الشربيني إسلام",
  sections: [
    {
      sectionHeader: "مهام رئيس القسم العلوم المحاسبية",
      sectionListItems: [
        "مناقشة العميد التقسيمات الخاصة بالجداول والامتحانات وما يترتب عليها من تجهيزات.",
        "الاشراف على تنفيذ القرارات التنفيذية والتأكد من سلامة اجراءات التنفيذ.",
        "اعداد خطة سنوية باحتياجات القسم من السادة أعضاء هيئة التدريس والهيئة المعاونة.",
        "تلقى مقترحات القسم فى شأن جودة التعليم ودراستها .",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين اعضاء هيئة التدريس وندبهم.",
      ],
    },
  ],
};

const basicSciences = {
  pageName: "basic-sciences",
  departmentHeadImageSrc: "",
  departmentHeadName: "أ.م.د / منصور شطا",
  sections: [
    {
      sectionHeader: "مهام رئيس قسم العلوم الأساسيه",
      sectionListItems: [
        "مناقشة العميد التقسيمات الخاصة بالجداول والامتحانات وما يترتب عليها من تجهيزات.",
        "تلقى مقترحات القسم فى شأن جودة التعليم ودراستها .",
        "اعداد خطة سنوية باحتياجات القسم من السادة أعضاء هيئة التدريس والهيئة المعاونة.",
        "الاشراف على تنفيذ القرارات التنفيذية والتأكد من سلامة اجراءات التنفيذ.",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين المدرسين المساعدين والمعيدين.",
        "اقتراح تعيين اعضاء هيئة التدريس وندبهم.",
      ],
    },
  ],
};

const informationTechnology = {
  pageName: "information-technology",
  sections: [
    {
      sectionName: "مهام مدير وحدة تكنولوجيا المعلومات",
      sectionListItems: [
        "الإشراف على البنية التحتية للشبكة والانظمة المتاحة.",
        "إدارة فرق من الفنيين ومهندسي النظام وغيرهم من موظفي تكنولوجيا المعلومات.",
        "متابعة مشاكل اجهزة الكمبيوتر و تقديم النصيحة بخصوص الحلول المناسبة.",
        "متابعة بيانات الموظفين والعملاء والاحتفاظ بالسجلات بشكل منظم.",
        "اختبار واصلاح المعدات والأجهزة التقنية.",
        "صيانة وتحسين شبكات المؤسسة المحلية والخوادم التابعة لها.",
        "الإشراف على عمليات النسخ الاحتياطي للبيانات وأمان النظام.",
        "إدارة عمليات التثبيت والترقيات وتكوينات الأجهزة والبرامج المستخدمة.",
        "تقييم أداء النظام والتوصية لإجراء التحسينات المطلوبة.",
        "تقديم الحلول والتوصيات لتجنب المشكلات التي تتعلق بالاجهزة وانظمة البيانات.",
        "التأكد من معالجة البيانات أو نقلها وفقًا للإرشادات القانونية وإرشادات المؤسسة.",
        "التحكم في التكاليف والميزانيات المتعلقة بأجهزة وأنظمة تكنولوجيا المعلومات.",
        "إدارة العقود مع الموردين مثل منصات التطوير وشركات الاتصالات وتراخيص البرامج والأنظمة.",
        "تطوير سياسات تكنولوجيا المعلومات والممارسات المتبعة.",
        "ما يكلف به من اعمال اخرى فى نطاق اختصاصاته.",
      ],
    },
    {
      sectionName: "مهام التعليم الإلكتروني",
      sectionListItems: [
        "انشاء بوابة جديدة للتعلم الألكتروني طبقا للمعايير الحديثة.",
        "تحويل جميع المقررات الى مقررات الكترونية طبقا لمواصفات الجودة.",
        "دعم وتشجيع أعضاء هيئة التدريس لتفعيل أنظمة التعليم الألكتروني .",
        "إعداد دورات لأعضاء هيئة التدريس والطالب في كيفية استخدام نظام التعلم الألكتروني.",
        "ماتكلف به من مهام أخرى فى نطاق إختصاص الإدارة.",
      ],
    },
  ],
};

const qualityAssurance = {
  pageName: "quality-assurance",
  sections: [
    {
      sectionName: "مهام وحدة ضمان الجودة",
      sectionListItems: [
        "تعمل وحدة ضمان الجودة على تطوير إجراءات العمل وتقديم الدعم الفني لوحدات ضمان الجودة بالمعهد وفقاً لمعايير الهيئة القومية لضمان جودة التعليم والإعتماد ، وبما يحقق مستوى عالى من رضاء محتلف الأطراف ذات الصلة.",
      ],
    },
    {
      sectionName: "مهام مدير وحدة ضمان الجودة",
      sectionListItems: [
        "متابعة أداء العمل بالوحدة واتخاذ الإجراءات اللازمة لانتظامه وانضباطه مع وضع آليات للتقويم الداخلي والخارجي.",
        "الاجتماع دوريا بجميع أعضاء الوحدة (هيئة التدريس + الإداريين).",
        "الإشراف الفني والإداري علي العاملين بالوحدة.",
        "متابعة أداء العمل بالوحدة واتخاذ الإجراءات اللازمة لانتظامه .",
        "مراجعة التقارير الدورية لمنسقي ضمان الجودة بأقسام المعهد.",
        "تطبيق نظم ضمان الجودة والانشطة الاكاديمية والبحثية والخدمية وفق معايير الاعتماد.",
        "الاختصاصات الأخرى التي يفوضه فيها مجلس إدارة الوحدة أو رئيسه.",
      ],
    },
  ],
};

const training = {
  pagename: "training",
  sections: [
    {
      sectionName: "مهام رئيس لجنة التدريب",
      sectionListItems: [
        "تحديد الإحتياجات التدريبية للموارد البشرية بالمعهد عن طريق استبيانات.",
        "وضع خطط تدريب لكافة الموارد البشرية مرتبطة بالإحتياجات التدريبية.",
        "متابعة تنفيذ خطة التدريب وتوفير الدعم اللوجيستي لتنفيذ الدورات داخل وخارج المعهد.",
        "تقييم التدريب وورش العمل بناء على نتائج الاستبيانات .",
        "وضع آلية لقياس أثر ومردود التدريب.",
        "عمل بيانات احصائية وتقرير دوري عما تنفيذه من الخطط التدريبية.",
      ],
    },
  ],
};

const educationAndStudentAffairs = {
  pageName: "education-and-student-affairs",
  sections: [
    {
      sectionName: "مهام مدير شئون الطلاب",
      sectionListItems: [
        "عمل شاغل هذه الوظيفة تحت التوجيه العام لوكيل المعهد لشئون التعليم والطلاب فنيا ولأمين المعهد إداريا.",
        "وضع الخطط والبرامج التنفيذية لشئون التسجيل والدراسة والامتحانات والخريجين ومتابعة تنفيذها.",
        "الاشراف علي قيد الطلاب الجدد وفقا للإخطارات الواردة من مكتب التنسيق ونتائج الامتحانات بالمعهد.",
        "مراقبة تنفيذ اللوائح والقوانين وتفسير ما قد يحتاج الي تفسير.",
        "الاشراف علي اجراءات الكشف الطبي للطلبة الجدد والتجنيد وسداد الرسوم والتأشير بها في السجلات.",
        "الاشتراك في وضع خطة التدريب الصيفي للطلاب سواء داخل المعهد أو خارجه.",
        "إعداد كافة المعلومات والبيانات الإحصائية الخاصة بالطلاب وإبلاغها لشئون التعليم بالمعهد.",
        "تدبير الامكانات البشرية (ملاحظين ومراقبين) لامتحانات المعهد.",
        "تنمية علاقات طيبة مع ادارات شئون الطلاب بالمعاهد الأخرى.",
        "القيام بما يسند إليه من أعمال مع رفع تقارير عن سير العمل لوكيل المعهد لشئون الطلاب.",
        "إستقبال الطلاب الجدد بالفرقة الاولى واستكمال أوراق…موافقة مكتب التنسيق وقبول ترشيح الطلاب المحولين .",
      ],
    },
  ],
};

const alumniAffairs = {
  pageName: "alumni-affairs",
  sections: [
    {
      sectionName: "مهام مدير شئون الخريجين",
      sectionListItems: [
        "اعداد نموذج بيانات الخريج ( استمارات بيانات خريج ).",
        "اعداد ملفات خاصة بالخريجين والاشراف على توزيع الاس…نات المتعلقة بالخريجين وتحليلها واعداد التقارير .",
        "عمل قاعدة بيانات لمتابعه الخريجين ووضعها على البوابة الالكترونية الخاصة بالمعهد.",
        "عقد لقاءات مع طلاب الفرقة النهائية بالمعهد لتوضيح …د بسوق العمل وتعريفهم بالجهوذ المبذولة فى المعهد.",
        "الاتصال بأصحاب العمل ومدى توفيرهم وظائف لخريجى المعهد.",
        "عقد ملتقى توظيف الخريجين الدورى الذى ينظمه المعهد مع اصحاب الاعمال.",
        "تطبيق معايير ومتطلبات الجودة.",
        "اتخاذ إجراءات اعتماد القرارات الخاصة بمنح الخريجين…رجات العلمية واجراءات اخلاء طرفهم وتسليم اوراقهم.",
        "التعاون مع كافة الادارات والاقسام بالمعهد وخاصة ادارة شئون التعليم والطلاب.",
        "الاشراف على اصدار شهادات التخرج للخريجين.",
        "متابعة الاتصال بالخريجين ومتابعتهم فى سوق العمل.",
        "اعداد تقارير دورية عن اداء العاملين بالادارة .",
        "الاشراف على صفحات التواصل مع الخريجين على مواقع التواصل الاجتماعى.",
        "اى مهام اخرى توكل اليه.",
      ],
    },
  ],
};

const personnelAffairs = {
  pageName: "personnel-affairs",
  sections: [
    {
      sectionName: "مهام مدير ادارة شئون العاملين",
      sectionListItems: [
        "الاشراف على العاملين بالوحدات التابعة له والتنسيق بين اعمالهم وتوجيههم.",
        "متابعة تطبيق القوانين والتعليمات التى تحكم العمل.",
        "الاشراف على اعمال التسجيل والوثائق ومتابعة اعمال القيد والحفظ والوارد والصادر بها.",
        "الاشراف على اعمال شئون الافراد بالمعهد واعداد المذكرات والموضوعات المطلوب عرضها.",
        "الاشراف على اعمال الخدمات الداخلية ودفاتر الحضور والانصراف واعمال النسخ والطبع.",
        "اعداد التقارير الدورية عن نشاط الشئون الادارية بالمعهد وعرضها على المسئولين.",
        "تقييم العاملين بالادارة ورفع توصيات بما يجب اتخاذه من اجراءات تطويرية او عقابية.",
        "التنسيق مع ادارة التدريب فى تنفيذ برامج التطوير الخاصة بالمرؤوسيين.",
        "ما يكلف به من اعمال اخرى فى نطاق اختصاصاته.",
      ],
    },
  ],
};

const financial = {
  pageName: "financial",
  sections: [
    {
      sectionName: "مهام ومسئوليات مدير الشئون المالية",
      sectionListItems: [
        "الاشراف على العاملين بالوحدات التابعة له والتنسيق بين اعمالهم وتوجيههم.",
        "متابعة تطبيق القوانين والتعليمات التى تحكم العمل.",
        "الاشراف على اعمال التسجيل والوثائق ومتابعة اعمال القيد للمعاملات المالية.",
        "وضع السياسات التي تنظم العمل ووضع خطط وبرامج العمل لتحقيق الاهداف المقرره.",
        "ضمان سلامة انجاز مهام الحسابات الماليه وأحكام سلامة الانفاق وتحصيل الاموال بحيث يسهل عملية اتخاذ القرارات.",
        "استخراج الحسابات بشكل دقيق واعداد التقارير الماليه الصحيحه لترشيد قرارات مجلس الاداره.",
        "اعداد التقارير الدورية عن نشاط الشئون المالية بالمعهد وعرضها على المسئولين.",
        "تقييم العاملين بالادارة ورفع توصيات بما يجب اتخاذه من اجراءات تطويرية او عقابية.",
        "ما يكلف به من اعمال اخرى فى نطاق اختصاصاته.",
      ],
    },
  ],
};

const engineering = {
  pageName: "engineering",
  sections: [
    {
      sectionName: "مهام مدير الشئون الهندسية",
      sectionListItems: [
        "تطبيق معايير ومتطلبات الجودة.",
        "الاشراف على الحالة الفنية للمبانى والمرافق اثناء العمل وبعد انتهائة.",
        "اعداد ومتابعة تنفيذ خطة الصيانة السنوية بعد اعتمادها.",
        "عمل كافة المقايسات الخاصة باحتياجات اعمال الصيانة.",
        "متابعة تنفيذ عقود الصيانة الموقعه مع الشركات المتخصصة.",
        "الاحتفاظ بالرسم الهندسى للمقرات واستخدامها عند الحاجه.",
        "الاشراف على المراجعة الدائمة لوسائل الامان والامن الصناعى وطفايات الحرائق وخراطيم المياه واغلاق المداخل والمخارج بصفة دورية واعداد التقارير الدورية عن نشاط الادارة الهندسية.",
        "اى مهام اخرى توكل اليه.",
      ],
    },
  ],
};

const purchasingAndWarehouse = {
  pageName: "purchasing-and-warehouse",
  sections: [
    {
      sectionName: "مهام مدير قسم المشتريات والمخازن",
      sectionListItems: [
        "المشاركة فى التخطيط و إعداد البرامج التنفيذية لإدارة المشتريات والمخازن.",
        "تنفيذ الخطط و البرامج التنفيذية الخاصة بإدارة المشتريات والمخازن.",
        "إقتراح الإجراءات التحسينية و العلاجية و الوقائية التى من شأنها تحسين أداء العمل بإدارته.",
        "المشاركة فى إعداد الميزانية المناسبة لإدارة المشتريات والمخازن فى حدود إمكانيات المعهد بناءاً على دراسات.",
        " مسئول عن تحديد الحدود المخزنية للأصناف وتكويد الأصناف.",
        "مسئول عن إصدار طلبات الشراء.",
        " المشاركة فى إعداد الإجراءات الخاصة بالمخازن.",
        "مسئول عن إمساك السجلات المخزنية ومتابعة أعمال التخزين وإصدار القرارات بكيفية التخزين.",
        "إصدار القرارات المناسبة فى حدود سلطاته و التى قد تكون سبباً فى تحسين الأداء المخزني.",
        "إجراء جرد دوري للمخازن كل ثلاث شهور ورفع نسخ منه لأمين المعهد.",
        "ما يكلف به من اعمال اخرى فى نطاق اختصاصاته.",
      ],
    },
  ],
};

const youthCare = {
  pageName: "youth-care",
  sections: [
    {
      sectionName: "مهام مدير ادارة رعاية الطلاب",
      sectionListItems: [
        "تطبيق معايير ومتطلبات الجودة.",
        "وضع خطط الانشطة الطلابية .",
        "متابعة تنفيذ الانشطة الداخلية والخارجية الخاصة بوزارة التعليم العالى.",
        "متابعة اقامة انشطة داخلية وخارجية المنصوص عليها فى خطة الوزارة.",
        "رفع تقارير عن سير العمل لعميد المعهد.",
      ],
    },
  ],
};

const medicalClinic = {
  pageName: "medical-clinic",
  sections: [
    {
      sectionName: "مهام مدير العيادة الطبية",
      sectionListItems: [
        "استقبال حالات الطوارئ من العاملين وهيئة التدريس وتقديم كل ما هو متاح من كشف وفحص وعلاج.",
        "استقبال الحالات المرضية من الطلبة المترددة يوميا وتقديم الكشف والعلاج.",
        "استقبال الحالات المزمنة مثل مرض السكر والحالات الخاصة والحالات النفسية وتقديم الكشف والفحوص والعلاج بصفة دورية.",
        "خدمات الإشراف الطبي على لجان الامتحانات طوال العام.",
        "خدمات الكشف الطبي على الطلبة الجدد.",
        "تقديم الخدمة العلاجية طوال العام.",
        "عمل إحصائيات سنوية بشان الطلبة والطالبات المترددين للعلاج وتقدم للجهات المختصة.",
        "الاشراف علي اتخاذ الاجراءات الوقائية بالنسبة للأمراض المعدية التي تظهر بين الطلاب.",
        "الكشف علي الطلاب قبل القيام بمعسكرات داخل وخارج المعهد او الرحلات.",
        " اعتماد الاجازات المرضية اثناء العام الدراسي والامتحانات.",
        "عقد لجان خاصة اذا احتاج الامر بالنسبة للطلاب المصابة.",
        "تنمية علاقات طيبة مع المستشفيات الحكومية.",
        "رفع تقارير عن سير العمل لوكيل المعهد لشئون التعليم والطلاب، الإشراف علي المرؤوسين وتوجيههم وتحفيزهم وتنميتهم، التعاون مع كافة الإدارات والأقسام بالمعهد",
      ],
    },
  ],
};

const library = {
  pageName: "library",
  sections: [
    {
      sectionName: "مهام مدير المكتبة",
      sectionListItems: [
        "الاشتراك في وضع البرامج التنفيذية الخاصة بالمكتبة ومتابعة تنفيذها.",
        "تزويد المكتبة بالكتب والدوريات العلمية.",
        "الاشتراك في وضع النظم الادارية التى تكفل حسن ادارة العمل بالمكتبة.",
        "متابعة عملية الاعارة الداخلية والخارجية طبقا للوائح والقوانين.",
        "القيام بأعمال الفهرسة والتصنيف لمقتنيات المكتبة طبقا لقواعد الفهرسة الفنية المعمول بها.",
        "اعداد بطاقات الفهارس المختلفة طبقا لقواعد الفهرسة الفنية المعمول بها والإشراف على تنظيم وترتيب الكتب والمراجع.",
        "اعداد فهرس مطبوع بمحتويات المكتبة.",
        "المشاركة فى الفحص الفنى لواردات المكتبة من أجهزة ومراجع.",
        "الأشراف على تطبيق قواعد الإستعارة والأشراف على تطبيق المكتبة الألكتروني.",
      ],
    },
  ],
};

const security = {
  pageName: "security",
  sections: [
    {
      sectionName: "مهام مدير إدارة الأمن",
      sectionListItems: [
        "وضع الخطط الكفيلة بتوفير الأمن والحماية للمعهد بموظفيه وطلابه والزوار.",
        "العمل على وضع الخطط للعناية بالزوار وخلق الانطباع الجيد عن المعهد.",
        "الدفاع عن المعهد وموظفيه وطلابه وزواره في حال حصول تهجم على أي منهم.",
        "الإشراف على كافة موظفي الأمن.",
        "وضع جدول الدوام والورديات لموظفي الأمن.",
        "وضع دليل الأنظمة والإجراءات لموظفي الأمن للتعامل مع الحالات الأمنية المختلفة.",
        "تدريب الموظفين كيفية التعامل في حال وجود حريق، أو حالات الكوارث الطبيعية، والإخلاء.",
        "التأكد من وجود وسائل الأمن والسلامة في المؤسسة.",
        "تنسيب موظفي الأمن للاشتراك بالدورات التدريبية الخاصة بالدفاع المدني والتعامل مع الحالات الأمنية.",
        "التعاون مع أجهزة الدولة في حال وقوع أي مشكلة في المؤسسة.",
        "الرقابة على موظفي القسم والتحقق من كفائتهم في العمل.",
        "العمل على حل أي مشكلة قد تظهر مع فريق العمل بشكل ودي.",
        "إعداد التقارير الدورية بسير العمل للإدارة.",
        "إعداد كشف باحتياجات الوحدة من الأجهزة وغيرها اللازمة من أجل سلامة الموظفين والزوار.",
        "أي مهام أخرى يكلف بها من قبل الإدارة ضمن نطاق العمل.",
      ],
    },
  ],
};

const importantRulesForStudents = {
  pageName: "",
  studentImportantRules: [
    { pdfName: "دليل الطالب", pdfSrc: "" },
    { pdfName: "الإرشاد الأكاديمي", pdfSrc: "" },
    { pdfName: "دليل ريادة علمية", pdfSrc: "" },
  ],
};

const followUpCommittee = {
  pageName: "follow-up-committee",
  committeeMembers: [
    {
      memberImageSrc: "",
      memberName: "د / أحمد البراشي",
      memberPositionName: "عضو في لجنة متابعة الخريجين",
    },
    {
      memberImageSrc: "",
      memberName: "د / عبدالسلام عاصى",
      memberPositionName: "عضو في لجنة متابعة الخريجين",
    },
    {
      memberImageSrc: "",
      memberName: "أ.د / حازم عطوه",
      memberPositionName: "رئيس لجنة متابعة الخريجين",
    },
    {
      memberImageSrc: "",
      memberName: "أ / مكرم رضوان",
      memberPositionName: "عضو في لجنة متابعة الخريجين",
    },
    {
      memberImageSrc: "",
      memberName: "أ / منى أحمد",
      memberPositionName: "عضو في لجنة متابعة الخريجين",
    },
    {
      memberImageSrc: "",
      memberName: "أ / أحمد صالح",
      memberPositionName: "عضو في لجنة متابعة الخريجين",
    },
  ],
  sections: [
    {
      sectionName: "مهام لجنة متابعة الخريجين",
      sectionListItems: [
        "عمل قاعدة بيانات ورابطة للخريجين.",
        "التواصل الدائم مع شئون الخريجين بالمعهد.",
        "وضع برامج لرفع كفاءة الخريجين.",
        "اسهام الخريجين فى تطوير وارتقاء المعهد.",
      ],
    },
  ],
};

// function getListContent(ul) {
//   const list = Array.from(ul.getElementsByTagName("li")).map(
//     (li) => li.textContent
//   );

//   return list;
// }
