import MainPageHeader from "@/app/ui/shared-ui/pages-components/main-page-header";
import imageSrc from "@/../../public/about-us/institute-management-images/institute-dean.jpg";
import MemberPhoto from "@/app/ui/about-us/institute-management/member-photo";
import MemberName from "@/app/ui/about-us/institute-management/member-name";
import MemberWord from "@/app/ui/about-us/institute-management/member-word";
import PageContentContainer from "@/app/ui/shared-ui/pages-components/page-content-container";

export default function Page() {
  return (
    <section>
      <MainPageHeader text="عميد المعهد" />
      <div className="p-2">
        <PageContentContainer>
          <MemberPhoto imageSrc={imageSrc} alt="رئيس مجلس الإدارة" />
          <MemberName memberName="كلمة السيد الدكتور أحمد أبو الفتوح" />
          <MemberWord
            memberWord="
            أبنائي وبناتي الطاب أمل المستقبل المشرق بمعهد الدلتا  
            العالي لنظم المعلومات الإدارية والمحاسبية. مع بداية 
            وإطلاله عام دراسي جديد يشرق على معهدنا ذو الكيان 
            والتاريخ العريق يطيب لي أن أرحب بكم على موقع 
            مؤسستكم التعليمية وأود أن أوجه خالص التحية إلى ادارة 
            المعهد ممثلة في السيد الدكتور / محمد ربيع ناصر رئيس   
            مجلس إدارة المعهد ورئيس الأكاديمية ورئيس مجلس أمناء  
            جامعة الدلتا للعلوم والتكنولوجيا والسيد الأستاذ / إيهاب  
            ناصر خليفه أمن المعهد ولكل من ينتسبون الى المعهد من  
            أعضاء هيئة التدريس والعاملين وأبنائي وبناتي سواء من  
            الخريجين أو من طاب المعهد، فتحية لكم من أعماقي ونحن  
            نسعى سويا الى بناء حاضر ومستقبل واعد ومشرق من اجل  
            مصرنا الحبيبة وسعيا نحو تحقيق ذلك يسعى المعهد دائما  
            الى مواكبة كل ما هو جديد باستخدام التقنيات الحديثة في  
            مجال الحاسب ونظم المعلومات بالدمج مع بعض العلوم  
            الأساسية كالمحاسبة والاقتصاد وإدارة الأعمال لسد  
            احتياجات سوق العمل من خريجي هذا المعهد ومن أجل ذلك  
            يحرص المعهد دائما بالدخول في العديد من المشاركات  
            وبروتوكولات. التعاون مع الجامعات المصرية وبعض  
            الشركات المتخصصة من أجل النهوض والارتقاء بمستوى  
            الخريج، كما يتواصل المعهد مع مؤسسات المجتمع المدني  
            لدراسة احتياجات سوق العمل للوفاء بها، هذا بالإضافة الى  
            إتاحة الفرصة لطاب المعهد للمشاركة في العديد من  
            الأنشطة الثقافية والرياضية والفنية الى تنظمها وزارة  
            التعليم العالي ومنح الطاب حوافز في شكل منح لتحفيزهم  
            على تحقيق المزيد من التفوق. كما يحرص المعهد على عقد  
            بعض ملتقيات التوظيف إتاحة فرص عمل بالعديد من  
            الشركات لأبنائنا الخريجين. وأخيرا أتمنى لجميع طالب المعهد  
            التوفيق والسداد وأن يوفقنا الله جميعا الى ما يحبه ويرضها. "
          />
        </PageContentContainer>
      </div>
    </section>
  );
}
